TexasInstruments/simplelink-lowpower-f2-sdk/examples/rtos/LP_EM_CC1354P10_1/zstack/zc_warningdevice/tirtos7/zc_warningdevice.syscfg
/* ======== Do device specific settings ======== */
const deviceName = system.getScript("/ti/ti154stack/ti154stack_common.js").getLaunchPadFromDevice();

/* Update LF Clock Source for CC2652RB devices */
if(deviceName.includes("RB"))
{
    device.srcClkLF = "Derived from HF XOSC";
}

if (deviceName.includes("R7") || deviceName.includes("P7"))
{
    NVS1.internalFlash.regionBase = 0xAA000;
    NVS1.internalFlash.regionSize = 0x4000;
}
else if (deviceName.includes("2674"))
{
    NVS1.internalFlash.regionBase = 0xFE000;
    NVS1.internalFlash.regionSize = 0x2000;
}
else
{
    NVS1.internalFlash.regionBase = 0x52000;
    NVS1.internalFlash.regionSize = 0x4000;
}


/* ======== TIRTOS7 ======== */
if (system.getRTOS() === "tirtos7") {

	/* ================ Boot configuration ================ */
	const Boot = scripting.addModule("/ti/sysbios/family/arm/cc26xx/Boot");
	/*
	* This module contains family specific Boot APIs and configuration settings.
	* See the SYS/BIOS API guide for more information.
	*/
	/*!
	*  Include a default customer configuration (CCFG) structure, default is
	*  false.
	*  Set to true to link in the default CCFG data structure in driverlib.
	*/
	Boot.customerConfig = false;


	/* ================ Clock configuration ================ */
	const Clock = scripting.addModule("/ti/sysbios/knl/Clock");
	/*
	* When using Power and calibrateRCOSC is set to true, this should be set to 10.
	* The timer used by the Clock module supports TickMode_DYNAMIC. This enables us
	* to set the tick period to 10 us without generating the overhead of additional
	* interrupts.
	*
	* Note: The calibrateRCOSC parameter is set within the Power configuration
	*     structure in the "Board.c" file.
	*/
	Clock.tickPeriod = 10;
	Clock.swiPriority = 4;


	/* ================ Error configuration ================ */
	const Error = scripting.addModule("/ti/sysbios/runtime/Error");
	/*
	* This function is called to handle all raised errors, but unlike
	* Error.raiseHook, this function is responsible for completely handling the
	* error with an appropriately initialized Error_Block.
	*
	* Pick one:
	*  - Error_UNWIND
	*      Returns back to the caller
	*  - Error_SPIN
	*      Simple alternative that traps on a while(1) loop for minimized target
	*      footprint
	*      Using Error_UNWIND, the Error.raiseHook will NOT called.
	*  - Error_TERMINATE
	*      Calls System_abort()
	*/
	//Error.policy = "Error_UNWIND";
	//Error.policy = "Error_TERMINATE";
	Error.policy = "Error_SPIN";

	/*
	* If set to a non-null value, the referenced function is always called when
	* an error is raised, even if the Error policy is TERMINATE.
	*
	* Pick one:
	*  - Error.print (default)
	*      Errors are formatted and output via System_printf() for easier
	*      debugging.
	*  - Null
	*      Errors are not formatted or logged. This option reduces code footprint.
	*  - non-null function
	*      Errors invoke custom user function. See the Error module documentation
	*      for more details.
	*/
	//Error.raiseHook = Error.print;
	Error.raiseHook = "NULL";
	//Error.raiseHook = "myErrorFxn";


	/* ================ Hwi configuration ================ */
	if (system.deviceData.deviceId.match(/P10/))
	{
		const Hwi = scripting.addModule("/ti/sysbios/family/arm/v8m/Hwi", {}, false);

		/*
		* Checks for Hwi (system) stack overruns while in the Idle loop.
		*
		* Pick one:
		*  - true (default)
		*      Checks the top word for system stack overflows during the idle loop and
		*      raises an Error if one is detected.
		*  - false
		*      Disabling the runtime check improves runtime performance and yields a
		*      reduced flash footprint.
		*/
		//Hwi.checkStackFlag = true;
		Hwi.checkStackFlag = false;
	
		/*
		* The following options alter the system's behavior when a hardware exception
		* is detected.
		*
		* Pick one:
		*  - Hwi.enableException = true
		*      This option causes the default Hwi.excHandlerFunc function to fully
		*      decode an exception and dump the registers to the system console.
		*      This option raises errors in the Error module and displays the
		*      exception in ROV.
		*  - Hwi.enableException = false
		*      This option reduces code footprint by not decoding or printing the
		*      exception to the system console.
		*      It however still raises errors in the Error module and displays the
		*      exception in ROV.
		*  - Hwi.excHandlerFunc = null
		*      This is the most aggressive option for code footprint savings; but it
		*      can difficult to debug exceptions. It reduces flash footprint by
		*      plugging in a default while(1) trap when exception occur. This option
		*      does not raise an error with the Error module.
		*/
		//Hwi.enableException = true;
		Hwi.enableException = false;
		//Hwi.excHandlerFunc = "Main_excHandler";
		//Hwi.excHandlerFunc = null;
	
		/*
		* Append any of the following settings to the nvicCCR array to enable the
		* corresponding hardware exception:
		*  - DIV_0_TRP: Enables hardware exception when dividing by zero
		*  - UNALIGN_TRP: Enables hardware exceptions when accessing unaligned memory
		*
		*/
		Hwi.nvicCCR = [];
		//Hwi.nvicCCR = ["DIV_0_TRP"];
		//Hwi.nvicCCR = [UNALIGN_TRP"];
		//Hwi.nvicCCR = ["DIV_0_TRP","UNALIGN_TRP"];
	
		/*
		* Number of interrupts supported by target device.
		*/
		Hwi.numInterrupts = 54;
	
		/*
		* Starting address to place the interrupt vector table.
		* Note: This is currently placed in RAM to allow for interrupts to be configured at runtime.
		*/
		/* Put interrupt vector at start of RAM so interrupts can be configured at runtime */
		Hwi.vectorTableAddress = system.utils.bigInt("020000000", 16);

	} 
	else 
	{
		const Hwi = scripting.addModule("/ti/sysbios/family/arm/m3/Hwi", {}, false);

		/*
		* Checks for Hwi (system) stack overruns while in the Idle loop.
		*
		* Pick one:
		*  - true (default)
		*      Checks the top word for system stack overflows during the idle loop and
		*      raises an Error if one is detected.
		*  - false
		*      Disabling the runtime check improves runtime performance and yields a
		*      reduced flash footprint.
		*/
		//Hwi.checkStackFlag = true;
		Hwi.checkStackFlag = false;
	
