TexasInstruments/simplelink-lowpower-f2-sdk/examples/rtos/LP_EM_CC1354P10_1/zstack/zc_warningdevice/tirtos7/zc_warningdevice.syscfg
		/*
		* The following options alter the system's behavior when a hardware exception
		* is detected.
		*
		* Pick one:
		*  - Hwi.enableException = true
		*      This option causes the default Hwi.excHandlerFunc function to fully
		*      decode an exception and dump the registers to the system console.
		*      This option raises errors in the Error module and displays the
		*      exception in ROV.
		*  - Hwi.enableException = false
		*      This option reduces code footprint by not decoding or printing the
		*      exception to the system console.
		*      It however still raises errors in the Error module and displays the
		*      exception in ROV.
		*  - Hwi.excHandlerFunc = null
		*      This is the most aggressive option for code footprint savings; but it
		*      can difficult to debug exceptions. It reduces flash footprint by
		*      plugging in a default while(1) trap when exception occur. This option
		*      does not raise an error with the Error module.
		*/
		//Hwi.enableException = true;
		Hwi.enableException = false;
		//Hwi.excHandlerFunc = "Main_excHandler";
		//Hwi.excHandlerFunc = null;
	
		/*
		* Append any of the following settings to the nvicCCR array to enable the
		* corresponding hardware exception:
		*  - DIV_0_TRP: Enables hardware exception when dividing by zero
		*  - UNALIGN_TRP: Enables hardware exceptions when accessing unaligned memory
		*
		*/
		Hwi.nvicCCR = [];
		//Hwi.nvicCCR = ["DIV_0_TRP"];
		//Hwi.nvicCCR = [UNALIGN_TRP"];
		//Hwi.nvicCCR = ["DIV_0_TRP","UNALIGN_TRP"];
	
		/*
		* Number of interrupts supported by target device.
		*/
		Hwi.numInterrupts = 54;
	
		/*
		* Starting address to place the interrupt vector table.
		* Note: This is currently placed in RAM to allow for interrupts to be configured at runtime.
		*/
		/* Put interrupt vector at start of RAM so interrupts can be configured at runtime */
		Hwi.vectorTableAddress = system.utils.bigInt("020000000", 16);
	}


	/* ================ Idle configuration ================ */
	const Idle       = scripting.addModule("/ti/sysbios/knl/Idle");
	const powerIdle  = Idle.addInstance();

	/*
	* The Idle module is used to specify a list of functions to be called when no
	* other tasks are running in the system.
	*
	* Functions added here will be run continuously within the idle task.
	*
	* Function signature:
	*     Void func(Void);
	*/
	powerIdle.$name   = "powerIdle";
	powerIdle.idleFxn = "Power_idleFunc"; /* Add the Power module's idle function */


	/* ================ Kernel (SYS/BIOS) configuration ================ */
	const BIOS = scripting.addModule("/ti/sysbios/BIOS");
	/*
	* Enable asserts in the BIOS library.
	*
	* Pick one:
	*  - true (default)
	*      Enables asserts for debugging purposes.
	*  - false
	*      Disables asserts for a reduced code footprint and better performance.
	*
	*  When using BIOS in ROM:
	*      This option must be set to false.
	*/
	//BIOS.assertsEnabled = true;
	BIOS.assertsEnabled = false;

	/*
	* Runtime instance creation enable flag.
	*
	* Pick one:
	*   - true (default)
	*      Allows Mod_create() and Mod_delete() to be called at runtime which
	*      requires a default heap for dynamic memory allocation.
	*   - false
	*      Reduces code footprint by disallowing Mod_create() and Mod_delete() to
	*      be called at runtime. Object instances are constructed via
	*      Mod_construct() and destructed via Mod_destruct().
	*
	*  When using BIOS in ROM:
	*      This option must be set to true.
	*/
	BIOS.runtimeCreatesEnabled = true;
	//BIOS.runtimeCreatesEnabled = false;

	/*
	* Enable logs in the BIOS library.
	*
	* Pick one:
	*  - true (default)
	*      Enables logs for debugging purposes.
	*  - false
	*      Disables logging for reduced code footprint and improved runtime
	*      performance.
	*
	*  When using BIOS in ROM:
	*      This option must be set to false.
	*/
	//BIOS.logsEnabled = true;
	BIOS.logsEnabled = false;

	BIOS.rtsGateType  = "BIOS_GateMutexPri";
	BIOS.heapSize     = 0x00000000;
	BIOS.heapType     = "HeapCallback";


	/* ================ Semaphore configuration ================ */
	const Semaphore = scripting.addModule("/ti/sysbios/knl/Semaphore");
	/*
	* Enables global support for Task priority pend queuing.
	*
	* Pick one:
	*  - true (default)
	*      This allows pending tasks to be serviced based on their task priority.
	*  - false
	*      Pending tasks are services based on first in, first out basis.
	*
	*  When using BIOS in ROM:
	*      This option must be set to false.
	*/
	//Semaphore.supportsPriority = true;
	Semaphore.supportsPriority = false;

	/*
	* Allows for the implicit posting of events through the semaphore,
	* disable for additional code saving.
	*
	* Pick one:
	*  - true
	*      This allows the Semaphore module to post semaphores and events
	*      simultaneously.
	*  - false (default)
	*      Events must be explicitly posted to unblock tasks.
	*
	*  When using BIOS in ROM:
	*      This option must be set to false.
	*/
	//Semaphore.supportsEvents = true;
	Semaphore.supportsEvents = false;


	/* ================ Swi configuration ================ */
	const Swi = scripting.addModule("/ti/sysbios/knl/Swi");
	/*
	* A software interrupt is an object that encapsulates a function to be
	* executed and a priority. Software interrupts are prioritized, preempt tasks
	* and are preempted by hardware interrupt service routines.
	*
	* This module is included to allow Swi's in a users' application.
	*/
	/*
	* Reduce the number of swi priorities from the default of 16.
	* Decreasing the number of swi priorities yields memory savings.
	*/
	Swi.numPriorities = 6;


	/* ================ System configuration ================ */
	const System = scripting.addModule("/ti/sysbios/runtime/System");
	/*
	* The Abort handler is called when the system exits abnormally.
	*
	* Pick one:
	*  - System_abortStd (default)
	*      Call the ANSI C Standard 'abort()' to terminate the application.
	*  - System_abortSpin
	*      A lightweight abort function that loops indefinitely in a while(1) trap
	*      function.
	*  - A custom abort handler
	*      A user-defined function. See the System module documentation for
	*      details.
	*/
	//System.abortFxn = "System_abortStd";
	System.abortFxn = "System_abortSpin";
	//System.abortFxn = "myAbortSystem";

