TexasInstruments/simplelink-lowpower-f2-sdk/examples/rtos/LP_EM_CC1354P10_1/zstack/zc_warningdevice/tirtos7/zc_warningdevice.syscfg
	/*
	* The Exit handler is called when the system exits normally.
	*
	* Pick one:
	*  - System_exitStd (default)
	*      Call the ANSI C Standard 'exit()' to terminate the application.
	*  - System_exitSpin
	*      A lightweight exit function that loops indefinitely in a while(1) trap
	*      function.
	*  - A custom exit function
	*      A user-defined function. See the System module documentation for
	*      details.
	*/
	//System.exitFxn = "System_exitStd";
	System.exitFxn = "System_exitSpin";
	//System.exitFxn = "myExitSystem";

	/*
	* Minimize exit handler array in the System module. The System module includes
	* an array of functions that are registered with System_atexit() which is
	* called by System_exit().
	*/
	System.maxAtexitHandlers = 1;

	/*
	* Enable System_printf() to display floats.  Use the longer '%f%$L%$S%$F'
	* if your code has SYS/BIOS instrumentation enabled (Asserts/Error/Log),
	* as is typical with the 'debug' profile.
	*/
	//System.extendedFormats = '%f%$L%$S%$F';
	//System.extendedFormats = '%f%$S';

	/*
	* The System.supportModule defines a low-level implementation of System
	* functions such as System_printf(), System_flush(), etc.
	*
	* Pick one pair:
	*  - SysMin
	*      This module maintains an internal configurable circular buffer that
	*      stores the output until System_flush() is called.
	*      The size of the circular buffer is set via SysMin.bufSize.
	*  - SysCallback
	*      SysCallback allows for user-defined implementations for System APIs.
	*      The SysCallback support module has a smaller code footprint and can be
	*      used to supply custom System_printf services.
	*      The default SysCallback functions point to stub functions. See the
	*      SysCallback module's documentation.
	*/
	//const SysMin = scripting.addModule("/ti/sysbios/runtime/SysMin");
	//System.supportModule = "SysMin";
	//SysMin.bufSize = 128;

	System.supportModule = "SysCallback";
	const SysCallback = scripting.addModule("/ti/sysbios/runtime/SysCallback");
	//SysCallback.abortFxn = "myUserAbort";
	//SysCallback.exitFxn  = "myUserExit";
	//SysCallback.flushFxn = "myUserFlush";
	//SysCallback.putchFxn = "myUserputch";
	//SysCallback.readyFxn = "myUserReady";


	/* ================ Task configuration ================ */
	const Task = scripting.addModule("/ti/sysbios/knl/Task");
	/*
	* Check task stacks for overflow conditions.
	*
	* Pick one:
	*  - true (default)
	*      Enables runtime checks for task stack overflow conditions during
	*      context switching ("from" and "to")
	*  - false
	*      Disables runtime checks for task stack overflow conditions.
	*
	*  When using BIOS in ROM:
	*      This option must be set to false.
	*/
	//Task.checkStackFlag = true;
	Task.checkStackFlag = false;

	/*
	* Set the default task stack size when creating tasks.
	*
	* The default is dependent on the device being used. Reducing the default stack
	* size yields greater memory savings.
	*/
	Task.defaultStackSize = 512;

	/*
	* Enables the idle task.
	*
	* Pick one:
	*  - true (default)
	*      Creates a task with priority of 0 which calls idle hook functions. This
	*      option must be set to true to gain power savings provided by the Power
	*      module.
	*  - false
	*      No idle task is created. This option consumes less memory as no
	*      additional default task stack is needed.
	*      To gain power savings by the Power module without having the idle task,
	*      add Idle.run as the Task.allBlockedFunc.
	*/
	Task.enableIdleTask = true;
	//Task.enableIdleTask = false;
	//Task.allBlockedFunc = Idle.run;

	/*
	* If Task.enableIdleTask is set to true, this option sets the idle task's
	* stack size.
	*
	* Reducing the idle stack size yields greater memory savings.
	*/
	Task.idleTaskStackSize = 512;

	/*
	* Reduce the number of task priorities.
	* Decreasing the number of task priorities yield memory savings.
	*/
	Task.numPriorities = 6;

	/* ================ GateMutexPri configuration ================ */
	const GateMutexPri = scripting.addModule("/ti/sysbios/gates/GateMutexPri");

	const Settings = scripting.addModule("/ti/posix/tirtos/Settings");

	/* ================ Memory configuration ================ */
	const HeapCallback = scripting.addModule("/ti/sysbios/heaps/HeapCallback");

	HeapCallback.initFxn            = 'osalHeapInitFxn';        // Call First When BIOS boot. Initialize the Heap Manager.
	HeapCallback.allocInstFxn       = 'osalHeapAllocFxn';       // Call for allocating a buffer
	HeapCallback.freeInstFxn        = 'osalHeapFreeFxn';        // Call for Freeing a buffer
	HeapCallback.getStatsInstFxn    = 'osalHeapGetStatsFxn';    // Return Statistic on the Heap.
	HeapCallback.isBlockingInstFxn  = 'osalHeapIsBlockingFxn';  // Return TRUE: This heap is always blocking ('Hwi Gate' like )

	const Memory = scripting.addModule("/ti/sysbios/runtime/Memory");


}
